import re

pattern_str = r'(^\s*订单号.*交易时间.*\d{2}:\d{2}:\d{2}$)' \
               r'|(^\s*(订单|订单号|订单编号)\s*[:|：]\s*\d+\s*$)' \
               r'|(^咨询订单号：\d+\s*商品ID：\d+$)' \
               r'|(您选择了一个订单进行咨询（订单号[:|：]\d+；商品编号[:|：]\d+）)' \
               r'|(查询订单号[:|：]\d+,\s*商品号[:|：]\d+)' \
               r'|(订单号[:|：]\d+\s*商品ID[:|：]\d+)'

pattern = re.compile(pattern_str, re.DOTALL)

s1 = "您选择了一个订单进行咨询（订单号：300667912046；商品编号：10112020500622）"
s2 = "查询订单号：296867643675, 商品号：10078236049326"
s3 = "订单号：293149178901 商品ID：10069230441348"


for s in [s1, s2, s3]:
    ans = pattern.finditer(s)
    print(list(ans))