import re


pattern_str1 = r'(订单号.*交易时间.*\d{2}:\d{2}:\d{2})|(咨询订单号：\d+\s*商品ID：\d+)|(\s*(订单|订单号|订单编号)\s*[:|：]\s*\d+\s*)'  # 生产环境
pattern_str2 = r'(^\s*订单号.*交易时间.*\d{2}:\d{2}:\d{2}$)|(^\s*(订单|订单号|订单编号)\s*[:|：]\s*\d+\s*$)'  # 当前环境
pattern_str3 = r'(^\s*订单号.*交易时间.*\d{2}:\d{2}:\d{2}$)|(^\s*(订单|订单号|订单编号)\s*[:|：]\s*\d+\s*$)|(^咨询订单号：\d+\s*商品ID：\d+$)' # 修改版本1
pattern_str4 = r'(^\s*订单号.*交易时间.*\d{2}:\d{2}:\d{2}$)|(^\s*(订单|订单号|订单编号|咨询订单号)\s*[:|：]\s*\d+\s*(商品ID：\d+)?$)'  # 修改版本2

s = "咨询订单号：291231623929    商品ID：10099423047273"  # 需要匹配上

s2 = '快递订单号：1234258482916538'  # 不能匹配上
pattern = re.compile(pattern_str3, re.DOTALL)

ans = pattern.finditer(s2)

for t in ans:
    print(t)
