import re


final_pattern = r"^订单(号)?[0-9]*[:：].*<手机号>.*<地名>.*$|" \
                r"^订单(号|编号)?[0-9]+$|" \
                r"^[0-9]+(这|这个|\s)*订单(号|编号)?$"

corpus = """
订单号3917168966487342519
订单号278182801082662053
订单号2170550571112989069
订单号1918036129417191679
订单编号3918361933354111207
订单编号2174574967725042096
3906813636743232301  订单号
3905764958748485142这个订单
3901763594447231412订单编号
3901763d594447231412订单编号
订单 ：1316984222317654349 
"""
corpus = corpus.split("\n")
# p = re.compile(final_pattern)

p = re.compile(r'(^订单(号|编号)?[0-9]+$)|'  # 消费者发送了订单详情
                r'(^[0-9]+(这|这个|\s)*订单(号|编号)?$)')

# p = re.compile(r'(^\s*订单号.*交易时间.*\d{2}:\d{2}:\d{2}$)|(^\s*(订单|订单号|订单编号)\s*[:|：]\s*\d+\s*$)')

for s in corpus:
    if not s:
        continue
    ans = p.search(s)
    print(len(s))
    print(ans)